<h2>Quiz 1 : Pivoting and Melting</h2>

Jelaskan itu pivoting dan melting data

jawaban : <b>Pivotting</b> adalah suatu perubahan bentuk data yang dimana bentuk perubahannya berupa baris menjadi kolom atau dapat di artikan pula sebagai perubahan bentuk data dari panjang menjadi lebar. <br> <br> <b>Melting</b> dapat didefinsikan juga sebagai "UnPivoting" yaitu perubahan bentuk data dimana kolom menjadi baris atau diartikan pula sebagai perubahan bentuk data dari lebar ke panjang.

<h2>Quiz 2 : Data structure Comprehension</h2>

Data yang rapi adalah :
1. Setiap row menunjukan suatu unit observasi
2. Setiap column merupakan suatu unit variable

Bagaimana pun, dalam menentukan unit observasi itu tergantung dari kasus yang di hadapi. sebagai seorang data scientist pasti akan menemukan berbagai bentuk struktur data. adalah sangat penting bagi seorang data scientist untuk dapat memahami dan menjelaskan setiap struktur data. Kemampuan memahami hubungan antara index baris, column dan isi data adalah kunci untuk memahami informasi apa yang data sedang beritahukan kepada kita.

Di bawah ini terdapat 2 data yang berisi sama, tetapi memiliki struktur yang berbeda. Jelaskan perbedaan dari 2 struktur data tersebut

![alt text](https://drive.google.com/uc?id=1h13CDPzIjc-2XyRcyu-p1fet0Ep1gdMA)

![alt text](https://drive.google.com/uc?id=12ji98ell5tNcCxeBzl4v8qqBtFMgDSr0)

Perbedaan mendasar yang dapat terlihat adalah tabel pertama merupakan tabel hasil pivoting tabel kedua. Dimana value pada kolom Mata Pelajaran pada tabel kedua menjadi kolom pada tabel pertama. <br> <br> Sementara value tabel pertama merupakan value dari tabel kedua pada kolom Rata2 Waktu Belajar (menit)

<h2>Quiz 3 : Reshaping Data 1</h2>

In [14]:
import pandas as pd
import random

data = {
    'Tipe Ujian' : ['UTS1', 'UAS1', 'UTS2', 'UAS2']*3,
    'Mata Pelajaran' : ['Fisika']*4 + ['Matematika']*4+['Statistika']*4,
    'Rata2 Waktu Belajar (menit)' : [random.choice(range(200, 800)) for i in range(12)],
    'Rata2 Nilai Ujian' : [random.choice(range(40, 100)) for i in range(12)] 
}
df = pd.DataFrame(data)
df

   Tipe Ujian Mata Pelajaran  Rata2 Waktu Belajar (menit)  Rata2 Nilai Ujian
0        UTS1         Fisika                          784                 46
1        UAS1         Fisika                          405                 40
2        UTS2         Fisika                          470                 71
3        UAS2         Fisika                          416                 63
4        UTS1     Matematika                          295                 54
5        UAS1     Matematika                          279                 98
6        UTS2     Matematika                          605                 89
7        UAS2     Matematika                          789                 94
8        UTS1     Statistika                          673                 90
9        UAS1     Statistika                          729                 40
10       UTS2     Statistika                          502                 51
11       UAS2     Statistika                          457                 50

Perhatikan data di atas, kemudian ubahlah bentuknya agar sesuai yang di harapkan.

In [15]:
df.pivot_table(index='Tipe Ujian', columns='Mata Pelajaran')

               Rata2 Nilai Ujian                        \
Mata Pelajaran            Fisika Matematika Statistika
Tipe Ujian
UAS1                          40         98         40
UAS2                          63         94         50
UTS1                          46         54         90
UTS2                          71         89         51

               Rata2 Waktu Belajar (menit)
Mata Pelajaran                      Fisika Matematika Statistika
Tipe Ujian
UAS1                                   405        279        729
UAS2                                   416        789        457
UTS1                                   784        295        673
UTS2                                   470        605        502

Expected Result :

![alt text](https://drive.google.com/uc?id=1XufsfqZe7-XZLsb92SpATexy-QRZE0ow)

<h2>Quiz 4 : Reshaping Data 2</h2>

In [12]:
import pandas as pd

data = {
    'Hari' : ['Sabtu', 'Minggu'],
    'Kebun Binatang' : [271, 399],
    'Dufan' : [501, 700],
    'Disney' : [1000, 1001],
    'Bali' : [900, 803]
}
df = pd.DataFrame(data).set_index('Hari')
pd.melt(df.reset_index(), id_vars=['Hari'], value_vars=['Kebun Binatang', 'Dufan', 'Disney', 'Bali'], var_name='Tempat Hiburan', value_name='Pengunjung')

     Hari  Tempat Hiburan  Pengunjung
0   Sabtu  Kebun Binatang         271
1  Minggu  Kebun Binatang         399
2   Sabtu           Dufan         501
3  Minggu           Dufan         700
4   Sabtu          Disney        1000
5  Minggu          Disney        1001
6   Sabtu            Bali         900
7  Minggu            Bali         803

diatas adalah data tentang jumlah pengunjung di berbagai tempat hiburan, ubahlah struktur data tersebut sehingga sesuai dengan hasil yang diharapkan.

Expected Result :

![alt text](https://drive.google.com/uc?id=159mIqcyfeD30EEcyZmmkovORa6cZDLtn)

<h2>Quiz 5 : Pivoting and Aggregating</h2>

In [11]:
import pandas as pd
import numpy as np

data = {
    'Tipe Ujian' : ['UTS1', 'UAS1']*3,
    'Mata Pelajaran' :['Statistika', 'Fisika', 'Fisika', 'Statistika', 'Fisika', 'Statistika'],
    'Jumlah Peserta' : [14, 17, 12, 16, 14, 13]
}
df = pd.DataFrame(data).set_index('Tipe Ujian')
df.pivot_table(index='Tipe Ujian', columns='Mata Pelajaran', values='Jumlah Peserta', aggfunc={'Jumlah Peserta': np.sum})

Mata Pelajaran  Fisika  Statistika
Tipe Ujian
UAS1                17          29
UTS1                26          14

Perhatikan bahwa data jumlah peserta ujian untuk suatu tipe ujian dan mata pelajaran tertentu ada yang duplikat, ubahlah struktur data tersebut dan lakukan aggregasi berjenis jumlah sehingga sesuai dengan hasil yang di harapkan

Expected Result :

![alt text](https://drive.google.com/uc?id=1emoz7orYR-0mCHffvAgM8j-V1P6yVHf0)